<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b7b7674bf67716c5caa80de1fa23c9047ad8ef77ad16f50384b6d47f994ab6d6","plan_job_ref":"Job Run Terraform plan in staging #130 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12601378125","plan_out_hash":"bc580776ae8463e7b97476f7ffb437976d1baf1f7856ee9ca85fa415ca576bbe","plan_hash":"0280f591aeaa588d749b7833fece1b014c05db04e0745e26525f6b502325a4a3","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "continuous_monitoring-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "NEt/aKAyd0e+z0VFUR5Eve6UkGQzOHJNAKkK8PUWIfk=" -> "waV1Wo3ko2HH5+Q/8uXvLT9mri1vFhIzvg25d8/vjMk="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-02T21:51:57Z" -> (known after apply)
#        (13 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #130](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12601378125)